Autodesk.Revit.DB.Analysis.SpatialFieldManager.SetMeasurementDescriptions(System.Collections.Generic.IList`1{System.String})
Sets Descriptions for all measurements
measurementDescriptions:
Array of measurement descriptions.
The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.
Throws Autodesk.Revit.Exceptions.ArgumentException:
measurementDescriptions lengths is not equal to the number of measurements set during creation of SpatialFieldManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.SpatialFieldManager.SetMeasurementNames(System.Collections.Generic.IList`1{System.String})
Sets Names for all measurements
measurementNames:
Array of measurement names. All names in the array must be unique.
The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.
Throws Autodesk.Revit.Exceptions.ArgumentException:
measurementNames contains duplicate names or its lengths is not equal to the number of measurements set during creation of SpatialFieldManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011